uhnp/src/Reports/ОтчетПоПоказателям/ОтчетПоПоказателям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоПоказателям</name>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоРасчета</name>
    <type>
      <types>CatalogRef.ПравилаОбработки</types>
    </type>
  </attributes>
</mdclass:Report>

uhnp/src/Enums/СпособыИспользованияОперандов/СпособыИспользованияОперандов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыИспользованияОперандов</name>
  <enumValues>
    <name>ДляФормулРасчета</name>
  </enumValues>
  <enumValues>
    <name>ДляПримечаний</name>
  </enumValues>
  <enumValues>
    <name>ДляОбратногоРаспределения</name>
  </enumValues>
  <enumValues>
    <name>ДляКонтрольныхСоотношений</name>
  </enumValues>
  <enumValues>
    <name>ДляРучныхКорректировок</name>
  </enumValues>
  <enumValues>
    <name>ДляПараметрическихУсловий</name>
  </enumValues>
  <enumValues>
    <name>ДляАналитическихОтчетов</name>
  </enumValues>
  <enumValues>
    <name>ДляТрансформационныхКорректировок</name>
  </enumValues>
  <enumValues>
    <name>ДляЗаполненияОбъектовБД</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныеДанные</name>
  </enumValues>
  <enumValues>
    <name>ДляСверкиВГО</name>
  </enumValues>
  <enumValues>
    <name>ДляОбменаДанными</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Reports/ОтчетПоПоказателям/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура Сформировать()
	
	Перем Вн_ДанныеРасшифровки;
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидОтчета", Отчет.ВидОтчета);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПравилоОбработки", Отчет.ПравилоРасчета);
	
	КомпоновщикМакета    = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки      = КомпоновщикМакета.Выполнить(ПолучитьИзВременногоХранилища(АдресСКД), КомпоновщикНастроек.ПолучитьНастройки(), Вн_ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ,Вн_ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ДанныеРасшифровки = ПоместитьВоВременноеХранилище(Вн_ДанныеРасшифровки, УникальныйИдентификатор);

	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ВидОтчета = Параметры.ВидОтчета;
	Отчет.ПравилоРасчета = Параметры.ПравилоОбработки;
	СКД      = Отчеты.ОтчетПоПоказателям.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	АдресСКД = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД));
	КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Сформировать();
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураОтвета = Расшифровать(Расшифровка, ДанныеРасшифровки);
	
	СтруктураПараметров=Новый Структура;
	СтруктураПараметров.Вставить("НазначениеРасчетов", Отчет.ПравилоРасчета);
	СтруктураПараметров.Вставить("ПотребительРасчета", СтруктураОтвета.Показатель);
	СтруктураПараметров.Вставить("СпособИспользования", ПредопределенноеЗначение("Перечисление.СпособыИспользованияОперандов.ДляФормулРасчета"));
	
	ОткрытьФорму("ОбщаяФорма.ФормаНастройкиФормулРасчета", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Расшифровать(Расшифровка, ДанныеРасшифровки)
	
	СтруктураОтвета = Новый Структура;
	
	Вн_ДанныеРасшифровки   = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	МассивПолейРасшифровки = ТиповыеОтчетыУХ.ПолучитьМассивПолейРасшифровки(Расшифровка, Вн_ДанныеРасшифровки, Неопределено, Истина);
	
	Для Каждого Элемент Из МассивПолейРасшифровки Цикл
		
		Если ТипЗнч(Элемент) <> Тип("ЗначениеПоляРасшифровкиКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураОтвета.Вставить(Элемент.Поле, Элемент.Значение);
		
	КонецЦикла;
	
	Возврат СтруктураОтвета;
	
КонецФункции
